<%@ Page Title="" Language="C#" MasterPageFile="~/XF.Master" AutoEventWireup="true"
    CodeBehind="fwxy.aspx.cs" Inherits="XF_Web_Concise.fwxy" %>

<asp:Content ID="Content1" ContentPlaceHolderID="mTitle" runat="server">
服务协议
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="mHead" runat="server">
    <link rel="stylesheet" href="css/fwxy.css" />
</asp:Content>
<asp:Content ID="Content3" ContentPlaceHolderID="mBody" runat="server">
    <div class="body-div">
        <div id="content">
            <h1>服务协议</h1>
            <p style="text-indent: 0; margin: 0;">
                尊敬的用户：</p>
            <p style="margin: 2px 0 0 0; text-decoration: 2em;">
                您好！在您注册成为本平台用户前，请仔细阅读本协议条款。您通过进入注册程序并勾选“ 已阅读并接受服务协议所有条款”，即表示您与本平台已达成协议，自愿接受本协议的全部条款。
            </p>
            <div id="con">
                <h3>
                    一、服务说明</h3>
                <p>
                    本协议是根据《中华人民共和国合同法》以及其它相关法律、法规的规定，参考各省（市）有关部门对法定证件相关服务的具体规定，由本平台与用户就本平台提供的综合信息服务相关事宜在平等、自愿、公平、诚信的基础上达成一致的文本。</p>
                <p>
                    其中：</p>
                <p>
                    用户，是指具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人；</p>
                <p>
                    本平台，是指幸福360综合信息服务网及其授权服务单位；</p>
                <p>
                    本服务，是指由本平台向用户提供的所有信息技术服务（包括但不限于相片自助采集，相片存储，相片下载，回执补打，相片冲印），实际提供服务以本平台业务说明为准。</p>
                <h3>
                    二、用户的权利与义务</h3>
                <p>
                    （一）用户有权利依据本平台服务规划自主选择对应的信息技术服务（包括但不限于相片自助采集，相片存储，相片下载，回执补打，相片冲印）。</p>
                <p>
                    （二）用户有权利在使用本服务时通过客服电话、客服邮箱获得本平台相应的客服支持。</p>
                <p>
                    （三）用户有义务认真阅读本平台公布的各种业务说明及管理规定（包括但不限于《用户手册》、《拍摄指南》、《充值须知》、《常见问题》），并熟练掌握相关技术内容。</p>
                <p>
                    （四）用户在使用本服务时，有义务按照本平台的相关规定及时、足额支付各项费用，用户的付费记录及账户余额以本平台计费系统产生的统计数据为准。</p>
                <p>
                    （五）用户在使用本服务前，必须注册成为本平台用户，并且同意：</p>
                <p>
                    1、用户有义务准确提供用户的真实、完整的资料。本平台若有合理理由怀疑用户提供的资料错误、不实、过时或不完整，有权暂停或终止向用户提供部分或全部服务，对此本平台不承担任何责任；</p>
                <p>
                    2、用户有义务及时更新资料，如果因用户未及时更新资料导致本服务无法提供或提供时发生任何错误，本平台不承担任何责任；</p>
                <p>
                    3、用户有义务对帐号安全负责，只有用户本人或被授权人可以使用，并在结束使用本服务时退出登录帐号。未经本平台同意，该帐号不可转借、转让、赠与、出租或出售他人，并不得利用该帐号从事对外的商业经营行为；</p>
                <p>
                    4、用户有义务在帐号遭到未授权的使用或发生其他任何安全问题时立即通知本平台，对因用户使用不当而造成的经济损失，本平台不承担任何责任，并保留追究由此对本平台产生不良后果的相关法律责任的权利。</p>
                <p>
                    （六）用户有义务自觉管理，严于律己，不得发生以下行为，否则本平台有权暂停或终止其帐号使用资格：</p>
                <p>
                    1、不得使用本便民服务从事对外的商业经营行为；</p>
                <p>
                    2、不得故意提供不实资料获取相关服务；</p>
                <p>
                    3、不得在未经他人同意的情况下获取其相片；</p>
                <p>
                    4、不得发生其违反他本平台相关管理规定的行为。
                </p>
                <p>
                    因用户上述行为导致任何第三方提出索赔要求或衍生的任何损害或损失，由其自行承担，本平台不承担任何责任，并保留追究由此对本平台产生不良后果的相关法律责任的权利。</p>
                <p>
                    （七）用户有义务对本平台公布的相关技术资料和文字资料进行保密，未经本平台同意，在履行协议期间和协议终止后，均不得以各种方式（包括但不限于介绍产品、发布广告、参加展览）对外提供，不得擅自使用、修改、复制、改变、散布、发行或发表本网站程序或内容，否则本平台有追究其相关法律责任的权利。</p>
                <p>
                    （八）如果服务中涉及实物配送，用户有义务清楚准确地填写您的真实姓名、送货地址及联系方式。因如下情况造成订单延迟或无法配送等，本平台不承担任何责任：</p>
                <p>
                    1、用户提供错误信息和不详细的地址；</p>
                <p>
                    2、货物送达无人签收，由此造成的重复配送所产生的费用及相关的后果。</p>
                <p>
                    3、不可抗力，例如：自然灾害、交通戒严、突发战争等。
                </p>
                <h3>
                    三、本平台权利与义务</h3>
                <p>
                    （一）本平台有权利自主对本服务作出合理规划，不受用户限制，并按照相关资费标准向用户收取服务费用，对于没有按时缴纳相关费用的注册用户本平台有权中止为用户提供部分或全部服务。</p>
                <p>
                    （二）本平台有权利根据自身业务需要对本协议内容进行调整，并以在本平台网站公告的方式予以公布，无需另行单独通知用户；若用户在本协议内容公告变更后继续使用本服务，表示用户已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若用户不同意修改后的协议内容，用户应立即停止使用本服务。</p>
                <p>
                    （三）本平台有义务对用户在使用本服务过程中所遇到的与本服务有关的问题及时作出回复。</p>
                <p>
                    （四）本平台有义务维护整个平台的正常运行，并努力提升和改进技术，使注册用户能正常使用本服务；系统因下列状况无法正常运作，使用户无法使用各项服务时，本平台不承担赔偿责任，该状况包括但不限于：</p>
                <p>
                    1、本平台在本网站公告之系统停机维护期间；</p>
                <p>
                    2、电信运营商设备出现故障不能进行数据传输的；</p>
                <p>
                    3、因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本平台系统障碍不能执行业务的；</p>
                <p>
                    4、由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。</p>
                <p>
                    （五）本平台有义务对用户的注册信息保密，在未获得用户许可前不得作为其它商业用途以及透露给第三方，但下列情况不在此承诺范围内：</p>
                <p>
                    1、用户允许披露这些注册信息；</p>
                <p>
                    2、司法机关或行政机关根据相关法律法规或行政规章、规定要求披露用户的注册信息。</p>
                <p>
                    3、根据行业服务特点，依据本平台业务规划认为有必要公布的。</p>
                <h3>
                    四、协议的变更和终止</h3>
                <p>
                    （一）当用户向本平台提出注销帐号，经本平台审核同意的，本平台可注销用户的帐号，本平台与用户的服务协议关系自动解除，注销帐号后本平台有权保留用户的注册信息以及使用记录。</p>
                <p>
                    （二）如果发现用户有违反本协议规定或违反相关法律的行为，本平台有权单方终止向用户提供服务，并向用户发出通知。</p>
                <p>
                    （三）如遇国家政策调整，本平台停止提供用户所对应的服务时，本协议将自动终止，因该种情况终止本协议的，本平台不承担违约责任，但应该提前发布公告，并提出合理解决方案。</p>
                <h3>
                    五、适用范围</h3>
                <p>
                    （一） 本协议由本协议条款与本平台公示的各项业务说明组成（包括但不限于《用户手册》、《拍摄指南》、《充值须知》、《常见问题》），相关名词可互相引用参照，如有不同理解，以本协议条款为准。用户对本协议理解和认同，即对本协议所有组成部分的内容理解并认同，一旦用户使用本服务，用户和本平台即受本协议所有组成部分的约束。本协议部分内容被有管辖权的法院认定为违法的，不影响其他内容的效力。</p>
                <p>
                    （二） 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。</p>
                <p>
                    （三） 在执行本协议中发生的任何争议，双方应通过友好协商的方式解决，如协商不成，任何一方均可在本平台住所地寻求法律途径解决。争议处理期间，应继续履行本协议不受影响的各项条款。</p>
                <p>
                    （四） 本协议的最终解释权属于幸福360综合信息服务网。</p>
            </div>
        </div>
        <a href="javascript:window.open('','_parent','');window.close();" class="button">返回</a>
    </div>
</asp:Content>
