var certificateJson = { '出入境证件': ['中国护照或往来港澳台通行证', '港澳台居民出入境证件', '驻澳门劳工证件', '外国人签证'],
    '居民身份证': ['居民身份证'],
    '居住证': ['居住证'],
    '社会保障卡': ['社会保障卡'],
    '机动车驾驶证': ['驾驶证'],
    '保安员证': ['保安员证']
    //'出国签证': ['美国非移民签证', '欧洲签证', '日本签证', '加拿大签证', '澳大利亚签证', '韩国签证', '新加坡签证', '泰国签证', '缅甸签证', '越南签证', '尼泊尔签证', '印度签证', '马来西亚签证', '菲律宾签证', '印尼签证', '新西兰签证', '土耳其签证', '南非签证', '阿联酋签证', '沙特阿拉伯签证', '埃及签证'],
    //'标准寸照': ['一寸(2.5*3.5cm)', '二寸(3.5*4.9cm)', '小一寸(2.2*3.2cm)', '大一寸(3.3*4.8cm)', '小二寸(3.5*4.5cm)', '大二寸(3.4*5.3cm)'],
    //'毕业证': ['毕业证(33*48mm)'],
    //'中小学生学籍相片': ['中小学生学籍相片(26*32mm)']
}

var cerToProJson = { '中国护照或往来港澳台通行证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省'],
    '港澳台居民出入境证件': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省'],
    '驻澳门劳工证件': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省'],
    '外国人签证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省'],
    '居民身份证': ['广东省', '江西省'],
    '居住证': ['广东省'],
    '社会保障卡': ['#广东省'],
    '驾驶证': ['广东省'],
    '保安员证': ['广东省']
}

//var cerToProJson = { '中国护照或往来港澳台通行证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '港澳台居民出入境证件': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '驻澳门劳工证件': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '外国人签证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '居民身份证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '居住证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '社会保障卡': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '驾驶证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆'],
//    '保安员证': ['广东省', '广西区', '重庆市', '云南省', '贵州省', '四川省', '江西省', '北京市', '天津市', '河北省', '山西省', '内蒙古', '辽宁省', '吉林省', '黑龙江省', '上海市', '江苏省', '浙江省', '安徽省', '福建省', '山东省', '河南省', '湖北省', '湖南省', '海南省', '西藏', '陕西省', '甘肃省', '青海省', '宁夏', '新疆']
//}

var proTocity = { '广东省': ['广州市', '深圳市', '珠海市', '汕头市', '佛山市', '韶关市', '湛江市', '肇庆市', '江门市', '茂名市', '惠州市', '梅州市', '汕尾市', '河源市', '阳江市', '清远市', '东莞市', '中山市', '潮州市', '揭阳市', '云浮市'],
    '广西区': ['南宁市', '柳州市', '桂林市', '梧州市', '北海市', '防城港市', '钦州市', '贵港市', '玉林市', '百色市', '贺州市', '河池市', '来宾市', '崇左市'],
    '重庆市': ['重庆市'],
    '云南省': ['昆明市', '曲靖市', '玉溪市', '保山市', '昭通市', '丽江市', '普洱市', '临沧市', '文山州', '红河州', '西双版纳州', '楚雄州', '大理州', '德宏州', '怒江州', '迪庆州'],
    '贵州省': ['贵阳市', '六盘水市', '遵义市', '安顺市', '黔南州', '黔西南州', '黔东南州', '铜仁地区', '毕节地区'],
    '四川省': ['成都市', '自贡市', '攀枝花市', '泸州市', '德阳市', '绵阳市', '广元市', '遂宁市', '内江市', '乐山市', '南充市', '宜宾市', '广安市', '达州市', '巴中市', '雅安市', '眉山市', '资阳市', '阿坝州', '甘孜州', '凉山州'],
    //'江西省': ['南昌市', '景德镇市', '萍乡市', '九江市', '新余市', '鹰潭市', '赣州市', '吉安市', '宜春市', '抚州市', '上饶市'],
    '#广东省': ['深圳市', '珠海市', '汕头市'],
    '江西省': ['九江市'],
    '北京市': ['北京市'],
    '天津市': ['天津市'],
    '河北省': ['石家庄市', '唐山市', '秦皇岛市', '邯郸市', '邢台市', '保定市', '张家口市', '承德市', '沧州市', '廊坊市', '衡水市'],
    '山西省': ['太原市', '大同市', '阳泉市', '长治市', '晋城市', '朔州市', '晋中市', '运城市', '忻州市', '临汾市', '吕梁市'],
    '内蒙古': ['呼和浩特市', '包头市', '乌海市', '赤峰市', '通辽市', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '兴安盟', '锡林郭勒盟', '阿拉善盟'],
    '辽宁省': ['沈阳市', '大连市', '鞍山市', '抚顺市', '本溪市', '丹东市', '锦州市', '营口市', '阜新市', '辽阳市', '盘锦市', '铁岭市', '朝阳市', '葫芦岛市'],
    '吉林省': ['长春市', '吉林市', '四平市', '辽源市', '通化市', '白山市', '松原市', '白城市', '延边州'],
    '黑龙江省': ['哈尔滨市', '齐齐哈尔市', '鸡西市', '鹤岗市', '双鸭山市', '大庆市', '伊春市', '佳木斯市', '七台河市', '牡丹江市', '黑河市', '绥化市', '大兴安岭'],
    '上海市': ['上海市'],
    '江苏省': ['南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港市', '淮安市', '盐城市', '扬州市', '镇江市', '泰州市', '宿迁市'],
    '浙江省': ['杭州市', '宁波市', '温州市', '嘉兴市', '湖州市', '绍兴市', '金华市', '衢州市', '舟山市', '台州市', '丽水市'],
    '安徽省': ['合肥市', '芜湖市', '蚌埠市', '淮南市', '马鞍山市', '淮北市', '铜陵市', '安庆市', '黄山市', '滁州市', '阜阳市', '宿州市', '六安市', '毫州市', '池州市', '宣城市'],
    '福建省': ['福州市', '厦门市', '莆田市', '三明市', '泉州市', '漳州市', '南平市', '龙岩市', '宁德市'],
    '山东省': ['济南市', '青岛市', '淄博市', '枣庄市', '东营市', '烟台市', '潍坊市', '济宁市', '泰安市', '威海市', '日照市', '莱芜市', '临沂市', '德州市', '聊城市', '滨州市', '菏泽市'],
    '河南省': ['郑州市', '开封市', '洛阳市', '平顶山市', '安阳市', '鹤壁市', '新乡市', '焦作市', '濮阳市', '许昌市', '漯河市', '三门峡市', '南阳市', '商丘市', '信阳市', '周口市', '驻马店市', '济源市'],
    '湖北省': ['武汉市', '黄石市', '十堰市', '宜昌市', '襄阳市', '鄂州市', '荆门市', '孝感市', '荆州市', '黄冈市', '咸宁市', '随州市', '恩施州', '仙桃市', '潜江市', '天门市', '神农架林区'],
    '湖南省': ['长沙市', '株洲市', '湘潭市', '衡阳市', '邵阳市', '岳阳市', '常德市', '张家界市', '益阳市', '郴州市', '永州市', '怀化市', '娄底市', '湘西州'],
    '海南省': ['海口市', '三亚市', '五指山市', '琼海市', '儋州市', '文昌市', '万宁市', '东方市', '定安县', '屯昌县', '澄迈县', '临高县', '白沙县', '昌江县', '乐东县', '陵水县', '保亭县', '琼中县', '三沙市'],
    '西藏': ['拉萨市', '昌都区', '山南区', '日喀则区', '那曲区', '阿里区', '林芝区'],
    '陕西省': ['西安市', '铜川市', '宝鸡市', '咸阳市', '渭南市', '延安市', '汉中市', '榆林市', '安康市', '商洛市'],
    '甘肃省': ['兰州市', '嘉峪关市', '金昌市', '白银市', '天水市', '武威市', '张掖市', '平凉市', '酒泉市', '庆阳市', '定西市', '陇南市', '临夏州', '甘南州'],
    '青海省': ['西宁市', '海东区', '海北州', '黄南市', '海南州', '果洛州', '玉树州', '海西州'],
    '宁夏': ['银川市', '石嘴山市', '吴忠市', '固原市', '中卫市'],
    '新疆': ['乌鲁木齐市', '克拉玛依市', '吐鲁番地区', '哈密地区', '昌吉州', '博尔塔拉州', '巴音郭楞州', '阿克苏地区', '克孜勒苏州', '喀什地区', '和田地区', '伊犁州', '塔城地区', '阿勒泰地区', '石河子市', '阿拉尔市', '图木舒克市', '五家渠市']
}

var cercode = new Array();
var idnumcode = new Array();
var colorcode = new Array();

cercode["中国护照或往来港澳台通行证"] = "10";
cercode["港澳台居民出入境证件"] = "12";
cercode["驻澳门劳工证件"] = "13";
cercode["外国人签证"] = "14";
cercode["广东居民身份证"] = "20";
cercode["广西居民身份证"] = "21";
cercode["江西居民身份证"] = "24";
cercode["广东居住证"] = "31";
cercode["广东驾驶证"] = "41";
cercode["广东保安员证"] = "51";
cercode["社会保障卡"] = "61";
cercode["一寸(2.5*3.5cm)"] = "81";
cercode["二寸(3.5*4.9cm)"] = "82";
cercode["小一寸(2.2*3.2cm)"] = "83";
cercode["大一寸(3.3*4.8cm)"] = "84";
cercode["小二寸(3.5*4.5cm)"] = "85";
cercode["大二寸(3.4*5.3cm)"] = "86";
cercode["美国非移民签证"] = "8A";
cercode["日本签证"] = "8B";
cercode["加拿大签证"] = "8G";
cercode["澳大利亚签证"] = "8H";
cercode["韩国签证"] = "8I";
cercode["新加坡签证"] = "8J";
cercode["泰国签证"] = "8L";
cercode["缅甸签证"] = "8M";
cercode["越南签证"] = "8N";
cercode["尼泊尔签证"] = "8O";
cercode["印度签证"] = "8P";
cercode["马来西亚签证"] = "8Q";
cercode["菲律宾签证"] = "8R";
cercode["印尼签证"] = "8S";
cercode["新西兰签证"] = "8T";
cercode["土耳其签证"] = "8U";
cercode["南非签证"] = "8V";
cercode["阿联酋签证"] = "8W";
cercode["沙特阿拉伯签证"] = "8X";
cercode["埃及签证"] = "8Y";
cercode["欧洲签证"] = "8Z";
cercode["毕业证"] = "87";
cercode["中小学生学籍相片"] = "88";
cercode["全国中国护照或往来港澳台通行证"] = "9A";
cercode["全国港澳台居民出入境证件"] = "9B";
cercode["全国驻澳门劳工证件"] = "9C";
cercode["全国外国人签证"] = "9D";
cercode["全国居民身份证"] = "92";
cercode["全国居住证"] = "93";
cercode["全国驾驶证"] = "94";
cercode["全国保安员证"] = "95";
cercode["全国社会保障卡"] = "96";

idnumcode["居民身份证"] = "";
idnumcode["军官证"] = "C";
idnumcode["士兵证"] = "D";
idnumcode["军官离退休证"] = "E";
idnumcode["境外人员身份证明"] = "F";
idnumcode["外交人员身份证明"] = "G";

colorcode["红"] = "1";
colorcode["白"] = "2";
colorcode["蓝"] = "3";